# GIT - это распределенная система контроля версий
# Это система для отслеживания и ведения истории изменения файлов в нашем проекте. При помощи git можно организовать командную работу.

# GitHub - это веб-сайт для размещения git-репозиториев в совместной разработке проектов.

# Репозиторий - это хранилище нашего кода и истории его изменений

# 1. git init - создает удаленный репозиторий, в той директории, в которой была прописана каманда
# 2. git add . - команда для добавления изменений в систему отслеживания гита(вместо . можно прописать любую папку)
# 3. git commit -m "something" - это команда для сохранения вмех ищменений с комментарнями
# 4. git branch -M main -это переименование
# 5. git remote add origin 'url' = это команда связывает наш локальный репозиторий с удаленным репозиторием Github
# 6. git push origin <main> - команда отправки наших изменений
# 7. git status - покащывает статус репозитория (какие то изменения на удаленный репозмиторий)
# 8. git brach - покащывает на какой ветке вы находитесь